import { motion as m } from 'framer-motion'
import { useEffect, useState } from 'react'
import Modal from './components/Modal'
export default function Presentation() {
	const [show, setShow] = useState(false)
	const [show1, setShow1] = useState(false)
	const [show2, setShow2] = useState(false)
	const [show3, setShow3] = useState(false)
	const [show4, setShow4] = useState(false)
	const [show5, setShow5] = useState(false)
	const [showModal, setShowModal] = useState(false)
	useEffect(() => {})
	return (
		<m.main
			initial={{ y: '100%' }}
			animate={{ y: '0%' }}
			transition={{ duration: 0.8, ease: 'easeOut' }}
			exit={{ opacity: 1 }}
			className=' absolute top-0 left-0 w-full h-full  lg:px-48 px-16'
		>
			<div className='text-center my-32  '>
				<h2 className='border-2 rounded-xl p-1 text-3xl text-blue-200 border-blue-400'>
					Возражения
				</h2>
				<div className='flex flex-col w-10/12 mx-auto my-3'>
					{' '}
					<button
						className='transition border-indigo-900 border-2 rounded-xl p-3 ease-in-out delay-150 bg-blue-700 hover:-translate-y-1 hover:scale-110 hover:bg-indigo-700 duration-300 my-1'
						onClick={() => setShowModal(1)}
					>
						ДК
					</button>
					{showModal === 1 && (
						<Modal isVisible={showModal === 1} onClose={() => setShowModal(0)}>
							<div className='text-xl'>
								<p>
									<button
										className='text-blue-300 hover:text-blue-500 duration-300'
										onClick={() => setShow(!show)}
									>
										Просто не надо. Правильно понимаю, обходитесь собственными
										средствами? Да.
									</button>
									<p className={`text-blue-100 content ${show ? 'show' : ''}`}>
										<p className='border-y-2 rounded-lg border-violet-300 py-2'>
											<a className='text-rose-100 my-2'>1. </a>Это здорово, что
											у Вас получается планировать свой бюджет кроме того хочу
											отметить, что цены постоянно растут. Поэтому, чтобы потом
											не сожалеть об упущенных возможностях и успеть купить
											товар по текущим ценнам, я предлагаю Вам рассмотреть наше
											предложение Что скажете?
										</p>
										<p className='my-2 border-y-2 rounded-lg border-violet-300 py-2'>
											<a className='text-rose-100 my-2 '>2.</a>Вижу Вы
											ответственно подходите к своим финансам И.О., Вам не
											нравится переплачивать, верно?(без паузы) Именно поэтому,
											специально для таких Клиентов как Вы, Банк и сделал
											нулевую переплату по спецпредложению - в нашем Банке
											действует программа финансовой защиты с возможностью
											накопления, что позволяет вернуть проценты в конце срока
											кредитования, при выполнении нескольких условий. Как Вам
											такое предложение?
										</p>
										<p className='border-y-2 rounded-lg border-violet-300 py-2 my-1'>
											<a className='text-rose-100 my-2'>3. </a>Да, временами мы
											не задумываемся о крупных планах И все же предлагаю
											поступить следуещим образом: мы с Вами рассмотрим
											возможность заполнения дистанционной анкеты, после чего, в
											случае положительного решения, с Вами свяжутся, озвучат на
											каких условиях Вам предлагают кредитование и уже на
											основании точных цифр Вы для себя решите выгодно это для
											вас или нет. Вы в любом случае ничего не теряете Давайте
											рассмотрим возможность заполнение анкеты и узнаем, что
											приготовил для Вас Банк. Согласны?
										</p>
									</p>
								</p>

								<button
									className='text-blue-300 hover:text-blue-500 duration-300'
									onClick={() => setShow1(!show1)}
								>
									Уже есть кредиты в других Банках
								</button>
								<p>
									<p className={`text-blue-100 content ${show1 ? 'show' : ''}`}>
										<p className='border-y-2 rounded-lg border-violet-300 py-2'>
											<a className='text-rose-100 my-2'>1. </a>Понимаю, чаще
											наличие кредитов - это финансовая нагрузка вместе с тем я
											могу предложить Вам альтернативный вариант, он позволит
											Вам воспользоваться нашими акциями, не отказываясь от
											работы с Вашим Банком. Таким образом Вы расширите круг
											своих возможностей. Что скажете?
										</p>
										<p className='my-2 border-y-2 rounded-lg border-violet-300 py-2'>
											<a className='text-rose-100 my-2 '>2.</a>Согласен, что
											иметь несколько кредитов нелегко Если Вам сейчас не нужны
											дополнительные наличные, можно рассмотреть вариант
											погашения действующего кредита в другом Банке за счет
											оформления в нашем, тем более в нашем Банке действует
											программа финансовой защиты с возможностью накопления, что
											позволяет вернуть проценты в конце срока кредитования, при
											выполнении нескольких условий. Как Вам такое предложение?
											<p className='border-y-2 rounded-lg border-violet-300 py-2 my-1'>
												<a className='text-rose-100 my-2'>3. </a>И.О., сейчас
												действительно почти у всех есть действующие кредиты тем
												не менее наличие действующих кредитов не является
												поводом для отказа от кредита в нашем Банке, предлагаю
												поступить следующим образом: мы с Вами заполним
												дистанционную анкету, после чего, в случае
												положительного решения, с Вами свяжутся, озвучат на
												каких условиях Вам предлагают кредитование и уже на
												основании точных цифр Вы для себя решите выгодно это для
												вас или нет. Вы в любом случае ничего не теряете
												Согласны?
											</p>
										</p>
									</p>

									<button
										className='text-blue-300 hover:text-blue-500 duration-300'
										onClick={() => setShow2(!show2)}
									>
										Исчезла необходимость. Правильно понимаю, обошлись без
										кредита, нашли денежные средства? Да.
									</button>
									<p>
										<p
											className={`text-blue-100 content ${show2 ? 'show' : ''}`}
										>
											<p className='border-y-2 rounded-lg border-violet-300 py-2'>
												<a className='text-rose-100 my-2'>1. </a>Замечательно,
												что обошлись без заемных средств вместе с тем, И.О.,
												сейчас Вы откажетесь, а чуть позже оставите заявку на
												кредит. Акция действовать не будет и придется оформлять
												на общих условиях, где платежи могут быть выше,
												рекомендую рассмотреть заявку прямо сейчас и не упускать
												возможность осуществить свою очередную мечту Что
												скажете?
											</p>
											<p className='my-2 border-y-2 rounded-lg border-violet-300 py-2'>
												<a className='text-rose-100 my-2 '>2.</a>Отлично, что у
												вас есть альтернативные варианты в получении суммы И.О.,
												А под 0% взяли бы?(без паузы) специально для таких
												Клиентов как Вы, Банк и сделал нулевую переплату по
												спецпредложению - в нашем Банке действует программа
												финансовой защиты с возможностью накопления, что
												позволяет вернуть проценты в конце срока кредитования,
												при выполнении нескольких условий. Как Вам такое
												предложение?
											</p>
											<p className='border-y-2 rounded-lg border-violet-300 py-2 my-1'>
												<a className='text-rose-100 my-2'>3. </a>Замечательно,
												что решили свой финансовый вопрос И все же предлагаю
												поступить следуещим образом: мы с Вами рассмотрим
												возможность заполнения дистанционной анкеты, после чего,
												в случае положительного решения, с Вами свяжутся,
												озвучат на каких условиях Вам предлагают кредитование и
												уже на основании точных цифр Вы для себя решите выгодно
												это для вас или нет. Вы в любом случае ничего не теряете
												Давайте рассмотрим возможность заполнение анкеты и
												узнаем, что приготовил для Вас Банк. Согласны?
											</p>
										</p>
									</p>

									<button
										className='text-blue-300 hover:text-blue-500 duration-300'
										onClick={() => setShow3(!show3)}
									>
										Высокий процент
									</button>
									<p>
										<p
											className={`text-blue-100 content ${show3 ? 'show' : ''}`}
										>
											<p className='border-y-2 rounded-lg border-violet-300 py-2'>
												<a className='text-rose-100 my-2'>1. </a>Хорошо, что
												обратили внимание на процент, видно что Вы обдуманно
												подходите к выбору Банка в то же время хочу обратить
												внимание, что в нашем Банке ставка начисляется не на всю
												сумму кредита, а на остаток задолженности, поэтому
												переплата будет значительно ниже. Предлагаю рассмотреть
												возможность заполнение анкеты. Что скажете?
											</p>
											<p className='my-2 border-y-2 rounded-lg border-violet-300 py-2'>
												<a className='text-rose-100 my-2 '>2.</a>И.О., вопрос
												цены действительно важен именно поэтому хочу обратить
												внимание, что в нашем Банке действует программа
												финансовой защиты с возможностью накопления, что
												позволяет вернуть проценты в конце срока кредитования,
												при выполнении нескольких условий. Согласитесь, выгодное
												предложение?
											</p>
											<p className='border-y-2 rounded-lg border-violet-300 py-2 my-1'>
												<a className='text-rose-100 my-2'>3. </a>Согласна, что
												необходимо принимать только взвешанное решение поэтому
												предлагаю поступить следующим образом: мы с Вами
												рассмотрим возможность заполнения дистанционной анкеты,
												после чего, в случае положительного решения, с Вами
												свяжутся, озвучат на каких условиях Вам предлагают
												кредитование и уже на основании точных цифр Вы для себя
												решите выгодно это для вас или нет. Вы в любом случае
												ничего не теряете Согласны?
											</p>
										</p>
									</p>
								</p>
							</div>
						</Modal>
					)}
					<button
						className='transition border-indigo-900 border-2 rounded-xl p-3 ease-in-out delay-150 bg-blue-700 hover:-translate-y-1 hover:scale-110 hover:bg-indigo-700 duration-300 my-1'
						onClick={() => setShowModal(2)}
					>
						халва
					</button>
					{showModal === 2 && (
						<Modal isVisible={showModal === 2} onClose={() => setShowModal(0)}>
							<p className='text-xl'>
								<button
									className='text-blue-300 hover:text-blue-500 duration-300'
									onClick={() => setShow5(!show5)}
								>
									Просто не надо. Правильно понимаю, обходитесь собственными
									средствами? Да.
								</button>
								<p className={`text-blue-100 content ${show5 ? 'show' : ''}`}>
									<p className='border-y-2 rounded-lg border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>1. </a> Беспорно радует
										Ваша финансовая стабильность вместе с тем, я не предлагаю
										Вам жить в кредит и переплачивать. Наоборот с КР Халва Вы
										сможете увеличить свой финансовый бюджет за счет кэшбека и
										начисления процентов на остаток Давайте рассмотрим
										возможность оформления карты. При положительном решении
										начнете пользоваться и будете приятно удивлены.Что скажете?
									</p>
									<p className='border-y-2 rounded-lg my-2 border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>2. </a> Здорово, что Вы
										ответственно подходите к финансовому вопросу И.О., с
										рассрочкой по карте Халва Вы не будете откладывать покупки!
										Хочу отметить, что мы все наблюдаем повсеместно повышение
										цен. Чтобы потом не сожалеть об упущенных возможностях,
										давайте рассмотрим оформление сейчас и сможете реализовать
										планы по текущим ценам и не переплачивать проценты
										Согласитесь это удобно?
									</p>
									<p className='border-y-2 rounded-lg border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>3. </a> Возможно Вам
										именно сейчас не нужно именно поэтому хочу обратить
										внимание, что договор оформляется на 5 лет, за это время
										наверняка будете совершать покупки, верно? Так вот, платить
										за то, что Вы просто оформляете карту не нужно и как только
										она Вам понадобится, Вы сможете ей воспользоваться (можно
										привести пример из жизни) Согласитесь, здорово когда есть
										запасной кошелек?
									</p>
								</p>
							</p>

							<button
								className='text-blue-300 hover:text-blue-500 duration-300 text-xl'
								onClick={() => setShow4(!show4)}
							>
								Пользуюсь картой другого Банка
							</button>
							<p className='text-xl'>
								<p className={`text-blue-100 content ${show4 ? 'show' : ''}`}>
									<p className='border-y-2 rounded-lg border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>1. </a> Это нормально и
										здорово иметь несколько карт позвольте отмечу, что если бы
										на рынке не было конкуренции получить выгодное предложение
										было бы невозможно. Предлагаю Вам не спешить отказываться и
										дать шанс нашей карте проявить себя, увере а она Вас приятно
										удивит Что скажите?
									</p>
									<p className='border-y-2 rounded-lg my-2 border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>2. </a> Я понимаю, что
										Ваша карта Вас вполне устраивает вместе с тем 90% Клиентов
										как и Вы, говорят, что картами уже пользуются и не
										рассматривают дополнительные карты, при этом больше половины
										отдают предпочтение КР Халва, так как с Халвой можно
										позволить себе лучшее здесь и сейчас не тратя время на
										оформление, и без переплаты преобритать товары Давайте
										рассмотрим возможность оформления карты. При положительном
										решении начнете пользоваться и будете приятно удивлены. Что
										скажете?
									</p>
									<p className='border-y-2 rounded-lg border-violet-300 py-2'>
										Понимаю, сейчас у каждого есть банковские карты в то же
										время Вы наверняка знаете, что каждая карта уникальна по
										своему. Например, с КР Халва Вы сможете увеличить свой
										финансовый бюджет за счет кэшбека и начисления процентов на
										остаток, а также выгодно преобретать товары в рассрочку, без
										переплат Предлагаю провести нашей карте своего рода
										тест-драйв и поверьте, Вы останетесь довольны. Что скажете?
									</p>
								</p>
							</p>

							<button
								className='text-blue-300 hover:text-blue-500 duration-300 text-xl'
								onClick={() => setShow2(!show2)}
							>
								Не нужна Халва без лимита правильно я понимаю, что необходим был
								именно кредитный лимит? Да
							</button>

							<p className='text-xl'>
								<p className={`text-blue-100 content ${show2 ? 'show' : ''}`}>
									<p className='border-y-2 rounded-lg border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>1. </a> Понимаю, что
										рассчитывали на кредитный лимит в то же время, при активном
										использовании карты, Банк каждые три месяца по собственной
										инициативе рассматривает возможность установления лимита по
										карте, и тогда Вы сможете уже использовать карту, как
										полноценную карту для покупок в рассрочку и снятия наличных
										Что скажете?
									</p>
									<p className='border-y-2 rounded-lg my-3 border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>2. </a> Понимаю, что
										предложение неожиданное вместе с тем хочу отметить, что при
										помощи данной карты Вы можете получать выгоду и при помощи
										собственных средств. Вы можете размещать собственные
										денежные средства на карте, расплачиваться ими в
										магазинах-партнерах и получать выгодный Cashback при
										соблюдении простых условий Давайте рассмотрим возможность
										оформления карты. При положительном решении начнете
										пользоваться и будете приятно удивлены.Что скажете?
									</p>
									<p className='border-y-2 rounded-lg my-3 border-violet-300 py-2'>
										{' '}
										<a className='text-rose-100 my-2'>3. </a> Согласна, что
										карта с лимитом, на первый взгляд может показаться
										интереснее и тем не менее, И.О. не спишите отказываться, так
										как одним из главных преимуществ карты является возможность
										хранить собственные денежные средства, и снимать от 3000
										рублей до 150 000 рублей в месяц в банкомате ЛЮБОГО Банка
										без комиссий. Предлагаю провести нашей карте своего рода
										тест-драйd и поверьте, Вы останетесь довольны. Что скажете?
									</p>
								</p>
							</p>

							<button
								className='text-blue-300 hover:text-blue-500 duration-300 text-xl'
								onClick={() => setShow3(!show3)}
							>
								Для пилота Доставка Халвы сразу -Зачем мне Халва, если мне нужен
								Кредит? -Подожду сначала решения по Кредиту
							</button>

							<p className='text-xl'>
								<p className={`text-blue-100 content ${show3 ? 'show' : ''}`}>
									<p className='border-y-2 rounded-lg border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>1. </a>Понимаю, что для
										Вас сейчас приоритетнее узнать решение по денежному
										кредитованию и тем не менее, получение карты заранее
										позволит Вам избежать дополнительной траты времени, пока Вы
										ожидаете решение, Вам привезут карту и оперативно перечислят
										на нее сумму, в случае положительного решения. Согласитесь
										так удобнее?
									</p>
									<p className='border-y-2 rounded-lg my-3 border-violet-300 py-2'>
										<a className='text-rose-100 my-2'>2. </a> Понимаю, что
										предложение неожиданное вместе с тем хочу отметить, что
										оформляя карту Вы ничего не теряете, так как она без
										годового обслуживания и Вы можете воспользоваться картой
										тогда, когда появятся необходимость Что скажете?
									</p>
									<p className='border-y-2 rounded-lg my-3 border-violet-300 py-2'>
										{' '}
										<a className='text-rose-100 my-2'>3. </a> Соглашусь, что
										важно выбрать наиболее удобный вариант именно поэтому мы
										предлагаем оформить карту, ведь в любом случае денежные
										средства по кредиту будут перечислены безналичным способом и
										оформление карты необходимо Куда назначим доставку?
									</p>
								</p>
							</p>
						</Modal>
					)}
					<button
						className='transition border-indigo-900 border-2 rounded-xl p-3 ease-in-out delay-150 bg-blue-700 hover:-translate-y-1 hover:scale-110 hover:bg-indigo-700 duration-300 my-1'
						onClick={() => setShowModal(3)}
					>
						Залог
					</button>
					{showModal === 3 && (
						<Modal isVisible={showModal === 3} onClose={() => setShowModal(0)}>
							<div className='flex flex-col justify-center content-center items-center'>
								<p className='text-xl'>
									<button
										className='text-blue-300 hover:text-blue-500 duration-300'
										onClick={() => setShow(!show)}
									>
										Клиент не согласен под залог собственного авто/недвижимости:
										3 возражения
									</button>
									<p className={`text-blue-100 content ${show ? 'show' : ''}`}>
										<p className='border-y-2 rounded-lg border-violet-300 py-2'>
											<a className='text-rose-100 my-2'>1. </a> тем не менее
											хочу отметить, что документы остаются у Вас на руках, Вы
											так же останетесь владельцем своего авто/недвижимости.
											Заполним заявку?
										</p>
										<p className='border-y-2 rounded-lg my-3 border-violet-300 py-2'>
											<a className='text-rose-100 my-2'>2. </a> И.О. предлагаю
											не принимать поспешных решений, в любом случаи решение за
											Вами. Сейчас есть возможность закрыть действующие кредиты,
											кредитные карты на более выгодных условиях. Что скажите?
										</p>
										<p className='border-y-2 rounded-lg border-violet-300 py-2'>
											<a className='text-rose-100 my-2'>3. </a> И.О. в любом
											случае Вы ничего не теряете, т.к. заполнение заявки Вас ни
											к чему не обязывает, Вам позвонят, озвучат условия и Вы
											уже решите, оформлять или нет. Согласны?
										</p>
									</p>
									<button
										className='text-blue-300 hover:text-blue-500 duration-300'
										onClick={() => setShow2(!show2)}
									>
										Клиент не согласен под залог близких: отработай 1 возражение
									</button>
									<p className={`text-blue-100 content ${show2 ? 'show' : ''}`}>
										<p className='border-y-2 rounded-lg border-violet-300 py-2'>
											Согласен, такой вариант вы пока не рассматривали. Именно
											поэтому уточню: что для автовладельцев сейчас доступно:-
											во-первых, подать заявку без визита в офис, - во-вторых,
											авто и документы остаются у владельца, - в-третьих,
											вероятность одобрения при наличии имущества, даже близких,
											значительно выше! Заполним заявку, получим ответ и Вы
											решите: захотите – воспользуетесь, нет-откажетесь.
											Рассмотрите такой вариант?
										</p>
									</p>

									<button
										className='text-blue-300 hover:text-blue-500 duration-300'
										onClick={() => setShow3(!show3)}
									>
										Клиент не согласен под залог, сумма нужна меньше: отработай
										1 возражение
									</button>
									<p className={`text-blue-100 content ${show3 ? 'show' : ''}`}>
										<p className='border-y-2 rounded-lg border-violet-300 py-2'>
											И.О, сразу видно, что Вы подходите к планированию своих
											расходов очень подготовлено, При этом, ИО, ведь есть
											вероятность, что этой суммы может не хватить на реализацию
											Ваших планов или они могут расшириться. В данном случае у
											Вас будет возможность подстраховаться на непредвиденные
											случаи, и иметь денежную сумму с запасом. Даже если Вы ее
											не потратите, то ведь есть возможность внести
											неиспользуемую сумму в счет погашения кредита. Заполним
											заявку, получим ответ и Вы решите: захотите –
											воспользуетесь, нет-откажетесь. Рассмотрите такой вариант?
										</p>
									</p>
								</p>
							</div>
						</Modal>
					)}
					<button
						className='transition border-indigo-900 border-2 rounded-xl p-3 ease-in-out delay-150 bg-blue-700 hover:-translate-y-1 hover:scale-110 hover:bg-indigo-700 duration-300 my-1'
						onClick={() => setShowModal(4)}
					>
						Кр.Доктор
					</button>
					{showModal === 4 && (
						<Modal isVisible={showModal === 4} onClose={() => setShowModal(0)}>
							<div className='text-xl'>
								<h2 className='text-xl text-blue-300'>
									Клиент не соглашается на КД: отработай 2 возражения ( при
									заявке на Халву, достаточно 1 РсВ с полным обротом)
								</h2>
								<p className='border-y-2 rounded-lg border-violet-300 py-2 my-2'>
									<a className='text-rose-100 my-2'>1. </a>Понимаю, что
									предложение неожиданное, тем не менее Чтобы не терять время,
									мы можем уже сейчас рассмотреть оформление, что скажите?
								</p>
								<p className='border-y-2 rounded-lg border-violet-300 py-2'>
									<a className='text-rose-100 my-2'>2. </a>И.О. не спешите
									отказываться, т.к. сейчас есть возможность пройти данную
									программу всего за 4.999, более того, есть возможность вернуть
									стоимость первого шага, при соблюдении простых условий. Что
									скажите?
								</p>
							</div>
						</Modal>
					)}
					<button
						className='transition border-indigo-900 border-2 rounded-xl p-3 ease-in-out delay-150 bg-blue-700 hover:-translate-y-1 hover:scale-110 hover:bg-indigo-700 duration-300 my-1'
						onClick={() => setShowModal(5)}
					>
						Дист.Заявка
					</button>
					{showModal === 5 && (
						<Modal isVisible={showModal === 5} onClose={() => setShowModal(0)}>
							<div className=''>
								<h2 className='text-xl text-blue-300'>Сам придет в офис</h2>
								<p className='border-y-2 rounded-lg border-violet-300 py-2 my-2'>
									<a className='text-rose-100 my-2'>1. </a> Да, увидеть условия
									наглядно, это важно Именно поэтому я предлагаю Вам оформить
									анкету сейчас, получить решение, условия кредитования Вам
									будут направлены, Вы сможете ознакомиться с ними не Выходя из
									дома Заполняем анкету?
								</p>
								<p className='border-y-2 rounded-lg border-violet-300 py-2'>
									<a className='text-rose-100 my-2'>2. </a>И.О., понимаю вас,
									обратиться в отделение Банка для многих привычнее При этом,
									оформляя дистанционно Вы получаете более Выгодные условия, с
									которыми Вы сможете ознакомиться до подписания договора. Как
									вам такое предложение?
								</p>
								<p className='border-y-2 rounded-lg border-violet-300 py-2'>
									<a className='text-rose-100 my-2'>3. </a>Возможно предложение
									неожиданное При этом этом заполнение анкеты не к чему вас не
									обязывает, а дает дополнительную возможность ознакомится с
									индивидуальными условиями в короткие сроки. Готовы? Продолжим
								</p>
								<h2 className='text-xl my-3 text-blue-300'>
									Клиент не согласен на кредит, заявка на Халву: отработай 1
									возражение
								</h2>
								<p className='border-y-2 rounded-lg border-violet-300 py-2'>
									Понимаю, что предложение неожиданное, дело в том, что Банк
									подготовил данное предложение с целью, что бы Вы себя
									порадовали. Конечно, могут быть сомнения. Тем не менее, не
									спешите отказываться, предлагаю просто заполнить заявку,
									получим ответ и Вы решите: захотите – воспользуетесь,
									нет-откажетесь. Рассмотрите такой вариант?
								</p>
							</div>
						</Modal>
					)}
					{/* <button
						className='transition border-indigo-900 border-2 rounded-xl p-3 ease-in-out delay-150 bg-blue-700 hover:-translate-y-1 hover:scale-110 hover:bg-indigo-700 duration-300 my-1'
						onClick={() => setShowModal(6)}
					>
						Мобилизация
					</button>
					{showModal === 6 && (
						<Modal isVisible={showModal === 6} onClose={() => setShowModal(0)}>
							<h2>Шестое модальное окно</h2>
						</Modal>
					)} */}
				</div>
			</div>
		</m.main>
	)
}
